# DeleteWorksetSettings Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DeleteWorksetSettings Constructor
DeleteWorksetSettings Class See Also
---
Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public DeleteWorksetSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DeleteWorksetSettings()
```

# See Also
DeleteWorksetSettings Class
DeleteWorksetSettings Overload
Autodesk.Revit.DB Namespace